# KeynoteEntries Properties

---
The KeynoteEntries type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from KeyBasedTreeEntries)
Top
#### Reference
KeynoteEntries Class
Autodesk.Revit.DB Namespace